{
  "basics": {
    "name": "Giulio Dellorbo",
    "label": "Staff Software Engineer",
    "picture": "./profile.jpg",
    "email": "egm0121[at]gmail.com",
    "phone": "(+1) 646·953·7352",
    "website": ["https://egm0121.com"],
    "summary": ["I'm an experienced Software Developer having previously worked on complex web, desktop and mobile apps in the enterprise travel booking and unified communications industries.",
                "My goal is to produce modular, reusable code leading to responsive UIs and performant applications.",
                "In my free time I like to build and launch software products, using lean methodology and experimentation to achieve growth and product-market fit."
              ],
    "location": {
      "address": "1504 Bay rd",
      "postalCode": "33139",
      "city": "Miami Beach",
      "countryCode": "US",
      "region": "Florida"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "egm0121",
        "url": "https://github.com/egm0121"
      },
      {
        "network": "LinkedIn",
        "username": "giuliodellorbo",
        "url": "https://www.linkedin.com/in/giuliodellorbo"
      },
      {
        "network": "Medium",
        "username": "Giulio Dellorbo",
        "url": "https://medium.com/@egm0121"
      },
      {
        "network": "Download CV",
        "username": "cv.pdf",
        "url": "./cv.pdf"
      }
    ]
  },
  "work": [
    {
      "company": "8x8 Inc",
      "position": "Principal Software Engineer",
      "website": "https://www.8x8.com/",
      "startDate": "2018-11-02",
      "endDate": "2025-12-31",
      "summary": "Responsible for designing and executing an incremental transition for core features of a production application written in Adobe AIR framework into a JS based codebase powering desktop and web apps using Electron and the React ecosystem. Identified technical debt and architectural improvements and created actionable engineering tasks. In depth code review of team members contributions. Authored internal tools such as CLI and Browser Extension to improve the dev. experience, testing and speed-up troubleshooting of production issues.Worked on Desktop specific features such as: OS-specific installers, dynamic libraries, auto-updates, and custom protocol handling. Served as technical point of contact for new integrations and PoCs with partners such as Citrix, Microsoft and Google.",
      "highlights": ["Electron", "React", "Redux", "WebRTC", "WebAssembly", "WebHID", "Cypress", "Playwright"]
    },
    {
      "company": "8x8 UK",
      "position": "Lead Frontend Developer - UK",
      "website": "https://www.8x8.com/uk",
      "startDate": "2015-05-01",
      "endDate": "2018-10-31",
      "summary": "Supervised a team of 6 frontend developers, functioned at a senior level in the organizational reported directly to the UK Director of Engineering.\n My responsabilities included  planning and assiging development tasks among team members, performing code reviews, guiding the techincal direction of the project and technologies to adpot, establishing a growth plan for the junior and mid level team members, efficently delegating tasks to build a performing and autonomous team. Involved in 50+ technical interviews and provided hiring reccomendation for all frontend engineers at the company.",
      "highlights": ["Browser Extension","ES6", "webpack", "Node.js"]
    },
    {
      "company": "DXI Ltd",
      "position": "Senior Frontend Developer",
      "website": "http://www.easycallnow.net/",
      "startDate": "2013-06-01",
      "endDate": "2015-05-01",
      "summary": "Joined DXI as their first senior frontend engineer, worked on a greenfield SPA used by thousands of contact center agents on a daily basis to handle incoming interactions, outbound calling and access to CRMs data. The frontend was based on Angular.js, Machina.js (FSM library) and made use of WebSockets for handling real time UI updates and instant messaging functionalities.Built a frontend components and services library used by other frontend projects. Built a websocket server using Node.js, socket.io and Redis to enable horizontal scaling and handling of several thousands WS connections per instance.",
      "highlights": ["WebSockets","Angular","Node.js","Electron"]
    },
    {
      "company": "UpCloo Ltd",
      "position": "Javascript Developer",
      "website": "https://github.com/upcloo",
      "startDate": "2012-07-01",
      "endDate": "2012-09-01",
      "summary": "As the main developer on the intergation widget I've gathered the business requirements, planned and implemented an async-loaded third party floating UI widget that was used by customer websites to display a list of related content pages powered by the correlation engine running in the backend.\nChallenges included keeping a small code footprint and make the widget was lazy loaded without hampering host website performance, handle broad browser compatibility (IE7 still had market share at that time) and preventing css styling conflicts and JS libraries interference. The final solution was a one line embeddable script tag that would load the widget and allow website admins to specify site configurations..",
      "highlights": [
        "Browser Compat.",
        "Async-loading",
        "CORS",
        "CSS3",
        "AWS",
        "JSONP",
        "Thirdparty code"
      ]
    },
    {
      "company": "Contur Srl",
      "position": "Fullstack Developer",
      "website": "http://www.contur.it/",
      "startDate": "2011-11-01",
      "endDate": "2013-06-01",
      "summary": "Worked on backend and frontend performance optimization and feature implementations for the company core application, enterprise travel management solution.On the backend side I've worked on new and existing integration via SOAP web services to communicate with GDS (Global Distribution System) systems.\n Worked on a solution to maintain a pool of valid session tokens and API response caching to maximize performance and reduce operational costs when requesting data from booking APIs that where billing on a api call model. I've also gained experience in SQL database modelling and query optimization. Implemented storerd procedures and caching. Frontend-wise, I've converted part of multi-page travel booking webapp to a single page experience with xhr requests, dynamic table components and maps based UIs. To organize the code base I've implemented a lightweight js library based on the cetralized pub-sub pattern to enhance frontend code modularization and communication between components. At the time jQuery was the most popular frontend library and state management or components frameworks had not been created yet.I've also worked on a Node.js + PhantomJS based headless browser integration test suite replicating end-user flows in our testing environment.",
      "highlights": [
        "PHP",
        "Redis",
        "REST",
        "SOAP",
        "Phantom.js",
        "Frontend perf."
      ]
    }
  ],
  "education": [
    {
      "institution": "Liceo Scientifico Marie Curie",
      "area": "Scientific Studies",
      "studyType": "High School Diploma",
      "startDate": "2006-09-01",
      "endDate": "2011-09-01"
    }
  ],
  "awards": [
    {
      "title": "AWS Certified Solutions Architect - Associate",
      "date": "2021-12-05",
      "awarder": "Amazon Web Services",
      "summary": "https://www.credly.com/badges/25297a38-035c-478d-bebb-27297e0fe1ba"
    },
    {
      "title": "Key Contributor Award",
      "date": "2016-07-01",
      "awarder": "8x8 Inc.",
      "summary": "Work on EasyContactNow infrastructure"
    },
    {
      "title": "PHP Certified Engineer",
      "date": "2008-11-18",
      "awarder": "Zend Technologies",
      "summary": "PHP Certification"
    }
  ],
  "publications": [
    {
      "name": "Mailbunny.ai | Faster newsletter reading",
      "publisher": "Web",
      "website": "https://ai.google.dev/competition/projects/mailbunny",
      "summary": "Built this LLM powered tool as a submission for the Google Gemini Dev competion. MailBunny helps relieving email fatigue and accelerates getting to inbox zero by reading incoming newsletter and sending you a summary of the most relevant content in a single daily email. Built with Google gemini-1.5-flash model, AWS Lambda, DynamDB, SQS, S3 and SES (Simple Email Service) for receiving inbound emails on custom @mailbunny.ai aliases."
    },
    {
      "name": "jest-test-gen | Unit test boilerplate generator",
      "publisher": "npm",
      "website": "https://github.com/egm0121/jest-test-gen",
      "summary": "Wrote a tool to generate boilerplate of a jest unit test file for an existing Javascript or Typescript source file with all imports mocked and a test template for every class, POJOs or functions exported. It also supports React components both classic and functional. The tool is written in typescript and uses its parser to walk the AST of a source file and generate testing code based on what is exported. It got featured by the popular Node Weekly newsletter and got 180+ stars on GitHub."
    },
    {
      "name" : "SpeedSound | Expo | Typescript",
      "publisher": "App Store and Play Store",
      "website": "https://www.speedsound.app/",
      "summary": "SpeedSound is a unique voice-based speedometer that uses voice notifications to update the user of its live speed.Real-time gps speedometer using your headphones or speaker.Computes the stats and speed graph for every activity.Multiple speed unit measures supported."
    },
    {
      "name" : "SplitCloud | React Native | 1M+ Downloads",
      "publisher": "App Store and Play Store",
      "website": "http://www.splitcloud-app.com/",
      "summary": "Share your headphones with who's next to you and stream two different tracks choosing from the SoundCloud® streaming platform. SplitCloud gives you two independent music players with adjustable volumes and playlist support. Scalable Backend for music charts and custom playlists in AWS Lambda + SQS + DynamoDB"
    },
    {
      "name": "$$Watchers - Chrome Dev Tools Extension",
      "publisher": "Google Chrome Web Store",
      "website":"http://goo.gl/c3nn5J",
      "summary" : "Angular watchers is the ultimate AngularJS tool which tells you how many active watchers you currently have in your web app. It automatically updates the count so you can see a counter or a graph by opening the $$watchers panel inside Chrome Dev Tools."
    },
    {
      "name": "SplitBeats - iOS App | Objective-C",
      "publisher": "Apple AppStore",
      "website": "http://www.split-beats.com/",
      "summary": "SplitBeats is a free music iOS app that allows your device to manage two music players at same time, and play different tracks on each side when sharing headphones."
    }
  ],
  "skills": [
    {
      "name": "Technologies",
      "level": "",
      "keywords": [
        "HTML5",
        "CSS3",
        "Javascript",
        "Typescript",
        "WebSockets",
        "JSON",
        "REST APIs",
        "JWT",
        "OAuth",
        "OTP",
        "Serverless",
        "Python",
        "Docker",
        "AWS",
        "PHP",
        "OOP",
        "SQL",
        "NoSQL",
        "Cache databases",
        "Perf. Optimization",
        "Browser Extensions",
        "Software Architecture",
        "UI Components",
        "Event Driven Architecture",
        "Microfrontends"
      ]
    },
    {
      "name": "Libraries and Frameworks",
      "level": "",
      "keywords": [
        "React",
        "Redux",
        "Immutable.js",
        "React Native",
        "Expo",
        "Gatsby",
        "Electron",
        "Socket.io",
        "Express",
        "Angular.js",
        "Google Analytics",
        "Webpack",
        "Jest",
        "Cypress",
        "Playwright",
        "Puppeteer",
        "pandas",
        "numpy",
        "statsmodel",
        "pyplot",
        "seaborn"
      ]
    }
  ],
  "languages": [
    {
      "language": "Italian",
      "fluency": "Native speaker"
    },
    {
      "language": "French",
      "fluency": "Bilingual"
    },
    {
      "language": "English",
      "fluency": "Bilingual"
    }
  ],
  "interests": [
    {
      "name": "Development",
      "keywords": [
        "Mobile App Development",
        "Distributed Systems",
        "Functional Programming",
        "Scalable Cloud Architectures",
        "Audio Programming",
        "IoT"
      ]
    }
  ],
  "references": [

  ]
}
