{
  "meta" : {
    "og":{
      "image": "https://cv.egm0121.com/profile.jpg",
      "url": "https://cv.egm0121.com",
      "description": "Hi! I'm an experienced Software Engineer having previously worked on complex web, desktop, and mobile apps for travel booking and enterprise communication industries."
    }
  },
  "basics": {
    "name": "Giulio Dellorbo",
    "nickname": "egm0121",
    "label": "Staff Software Engineer",
    "picture": "./profile.jpg",
    "email": "egm0121[at]gmail.com",
    "phone": "(+1) 646\t·95\t3·73\t52",
    "website": ["https://egm0121.com"],
    "summary": ["I'm an experienced Software Engineer having previously worked on complex web, desktop and mobile apps for travel booking and enterprise communication industries.",
                "My goal is to produce modular, reusable code leading to responsive UIs and performant applications.",
                "In my free time, I like to build and launch software products, using lean methodology and experimentation to achieve growth and product-market fit."
              ],
    "location": {
      "address": "1504 Bay rd",
      "postalCode": "33139",
      "city": "Miami Beach",
      "countryCode": "US",
      "region": "Florida"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "egm0121",
        "url": "https://github.com/egm0121"
      },
      {
        "network": "LinkedIn",
        "username": "giuliodellorbo",
        "url": "https://www.linkedin.com/in/giuliodellorbo"
      },
      {
        "network": "Medium",
        "username": "Giulio Dellorbo",
        "url": "https://medium.com/@egm0121"
      },
      {
        "network": "Download CV",
        "username": "cv.pdf",
        "url": "./cv.pdf"
      }
    ]
  },
  "work": [
    {
      "company": "8x8 Inc",
      "position": "Principal Software Engineer",
      "website": "https://www.8x8.com/",
      "startDate": "2018-11-02",
      "endDate": "current",
      "summary": "Responsible for planning and executing an incremental transition of core features for a production app written in Adobe AIR framework into a React + Electron codebase powering desktop and web platforms.\nIdentified technical debt and architectural improvements and planned actionable engineering tasks.\nCode-reviewed contributions from team members.\nWorked on Desktop specific features such as OS-specific installers, dynamic libraries, auto-updates, and custom protocol handling.\nServed as technical point of contact for new integrations and PoCs with partners such as Citrix, Microsoft, and Google.\nAuthored internal tools to improve the dev-experience and speed up time to fix defects.\nWorked on a company-wide effort to create standardized internal tools and libraries to solve cross-cutting concerns across all frontend projects such as reusable UI components, observability helpers and micro-frontends.",
      "highlights": ["Electron", "React", "Redux", "WebRTC", "WebAssembly", "WebHID", "Cypress", "Playwright"]
    },
    {
      "company": "8x8 UK",
      "position": "Lead Frontend Developer - UK",
      "website": "https://www.8x8.com/uk",
      "startDate": "2015-05-01",
      "endDate": "2018-10-31",
      "summary": "Supervised a team of 6 frontend developers, functioned at a senior level in the organization reporting directly to the UK Director of Engineering.\nMy responsibilities included planning and assigning development tasks among team members, performing code reviews, guiding the technical direction of the project and technologies to adopt, establishing a growth plan for the junior and mid-level team members, and efficiently delegating tasks to build a performing and autonomous team.\nInvolved in 50+ technical interviews and provided hiring reccomendations for all frontend engineers at the company.",
      "highlights": ["Browser Extension","ES6", "webpack", "Node.js"]
    },
    {
      "company": "DXI Ltd",
      "position": "Senior Frontend Developer",
      "website": "http://www.easycallnow.net/",
      "startDate": "2013-06-01",
      "endDate": "2015-05-01",
      "summary": "Joined DXI as their first senior frontend engineer, worked on a greenfield SPA used by thousands of contact center agents on a daily basis to handle incoming interactions, outbound calling, and access to CRMs data.\nFrontend app was based on Angular.js, Machina.js (FSM library) and made use of WebSockets for handling real-time UI updates and instant messaging functionalities.\nBuilt a library of UI components and services reusable in other frontend projects.\nBuilt a websocket server using Node.js, socket.io, and Redis to enable horizontal scaling and handling of several thousands WS connections per instance.",
      "highlights": ["WebSockets","Angular","Node.js","Electron"]
    },
    {
      "company": "UpCloo Ltd",
      "position": "Javascript Developer",
      "website": "https://github.com/upcloo",
      "startDate": "2012-07-01",
      "endDate": "2012-09-01",
      "summary": "As the main developer on the integration widget, I've gathered the business requirements, planned and implemented an async-loaded third-party floating UI widget used by customer websites to display related content powered by the correlation engine wrote by the backend team.\nChallenges included keeping a small code footprint and making the widget was lazy loaded without hampering host website performance, handling broad browser compatibility (IE7 still had market share at that time) and preventing css styling conflicts or JS libraries interference. The final solution was a one-line embeddable script tag that would load the widget and allow website admins to specify site configurations.",
      "highlights": [
        "Browser Compat.",
        "Async-loading",
        "CORS",
        "CSS3",
        "AWS",
        "JSONP",
        "Thirdparty code"
      ]
    },
    {
      "company": "Contur Srl",
      "position": "Fullstack Developer",
      "website": "http://www.contur.it/",
      "startDate": "2011-11-01",
      "endDate": "2013-06-01",
      "summary": "Worked as a full-stack developer on a web-based travel booking and management solution using PHP, Zend Framework, MySQL, and Redis.\nWorked on both new and existing features consuming SOAP web services to communicate with GDS (Global Distribution System) systems.\nImplemented extensive request caching and invalidation rules to maximize performance and reduce operational costs when using travel APIs billed by api request volume.\nGained experience in SQL database modeling and slow query optimization.\nFrontend-wise, I've converted the multi-page website to a single-page experience with API requests, dynamic table components and maps-based UIs.\n -Authored several jQuery plugins and built a lightweight JS framework based on the mediator pattern to enhance code decoupling and communication between components.",
      "highlights": [
        "PHP",
        "Redis",
        "REST",
        "SOAP",
        "Phantom.js",
        "Frontend perf."
      ]
    }
  ],
  "education": [
    {
      "institution": "Liceo Scientifico Marie Curie",
      "area": "Scientific Studies",
      "studyType": "High School Diploma",
      "startDate": "2006-09-01",
      "endDate": "2011-09-01"
    },
    {
      "institution": "ESOL Level 1 Certificate in English",
      "area": "Language certificate",
      "studyType": "ESOL Level 1 - B2",
      "startDate": "2010-03-01"
    },
    {
      "institution": "DELF B2 - Langue Française",
      "area": "Language certificate",
      "studyType": "DELF B2",
      "startDate": "2010-08-11"
    }
  ],
  "awards": [
    {
      "title": "AWS Certified Solutions Architect - Associate",
      "date": "2021-12-05",
      "awarder": "Amazon Web Services",
      "summary": "https://www.credly.com/badges/25297a38-035c-478d-bebb-27297e0fe1ba"
    },
    {
      "title": "Key Contributor Award",
      "date": "2016-07-01",
      "awarder": "8x8 Inc.",
      "summary": "Work on EasyContactNow infrastructure."
    },
    {
      "title": "PHP Certified Engineer",
      "date": "2008-11-18",
      "awarder": "Zend Technologies",
      "summary": "PHP Certification"
    }
  ],
  "publications": [
    {
      "name": "Mailbunny.ai | Faster newsletter reading",
      "publisher": "Web",
      "website": "https://ai.google.dev/competition/projects/mailbunny",
      "summary": "Built this LLM-powered tool as a submission for the Google Gemini Dev competition. MailBunny helps relieve email fatigue and accelerates getting to inbox zero by reading incoming newsletters and sending you a summary of the most relevant content in a single daily email. Leveraging Google's gemini-1.5-flash model, AWS Lambda, DynamDB, SQS, S3, and SES (Simple Email Service) for receiving inbound emails on custom @mailbunny.ai aliases."
    },
    {
      "name": "jest-test-gen | Unit test boilerplate generator",
      "publisher": "npm",
      "website": "https://github.com/egm0121/jest-test-gen",
      "summary": "Wrote a tool to generate boilerplate of a jest unit test file for an existing Javascript or Typescript source file with all imports mocked and a test template for every class, POJOs or functions exported. It also supports React components both classic and functional. The tool is written in typescript and uses its parser to walk the AST of a source file and generate testing code based on what is exported. It was featured by the popular Node Weekly newsletter and reached 180+ stars on GitHub."
    },
    {
      "name" : "SpeedSound | Expo | Typescript",
      "publisher": "App Store and Play Store",
      "website": "https://www.speedsound.app/",
      "summary": "SpeedSound is a unique voice-based speedometer that uses voice notifications to update the user of its live speed. Real time GPS speedometer using your headphones or speaker.Computes the stats and speed graph for every activity.Multiple speed unit measures supported."
    },
    {
      "name" : "SplitCloud | React Native | 1M+ Downloads",
      "publisher": "App Store and Play Store",
      "website": "http://www.splitcloud-app.com/",
      "summary": "Share your headphones with who's next to you and stream two different tracks and access the SoundCloud® streaming platform. SplitCloud gives you two independent music players with adjustable volumes and playlist support. Scalable Backend for music charts and custom playlists in AWS Lambda + SQS + DynamoDB"
    },
    {
      "name": "$$Watchers - Chrome Dev Tools Extension",
      "publisher": "Google Chrome Web Store",
      "website":"http://goo.gl/c3nn5J",
      "summary" : "Angular watchers is the ultimate AngularJS tool which tells you how many active watchers you currently have in your web app. It automatically updates the count so you can see a counter or a graph by opening the $$watchers panel inside Chrome Dev Tools."
    },
    {
      "name": "SplitBeats - iOS App | Objective-C",
      "publisher": "Apple AppStore",
      "website": "http://www.split-beats.com/",
      "summary": "SplitBeats is a free music iOS app that allows your device to manage two music players at same time, and play different tracks on each side when sharing headphones."
    }
  ],
  "skills": [
    {
      "name": "Technologies",
      "level": "",
      "keywords": [
        "HTML5",
        "CSS3",
        "Javascript",
        "Typescript",
        "WebSockets",
        "JSON",
        "REST APIs",
        "JWT",
        "OAuth",
        "OTP",
        "Serverless",
        "Python",
        "Docker",
        "AWS",
        "PHP",
        "OOP",
        "SQL",
        "NoSQL",
        "Cache databases",
        "Perf. Optimization",
        "Browser Extensions",
        "Software Architecture",
        "UI Components",
        "Event Driven Architecture",
        "Microfrontends"
      ]
    },
    {
      "name": "Libraries and Frameworks",
      "level": "",
      "keywords": [
        "React",
        "Redux",
        "Immutable.js",
        "React Native",
        "Expo",
        "Gatsby",
        "Electron",
        "Socket.io",
        "Express",
        "Angular.js",
        "Google Analytics",
        "Webpack",
        "Jest",
        "Cypress",
        "Playwright",
        "Puppeteer",
        "pandas",
        "numpy",
        "statsmodel",
        "pyplot",
        "seaborn"
      ]
    }
  ],
  "languages": [
    {
      "language": "Italian",
      "fluency": "Native speaker"
    },
    {
      "language": "French",
      "fluency": "Bilingual"
    },
    {
      "language": "English",
      "fluency": "Bilingual"
    }
  ],
  "interests": [
    {
      "name": "Development",
      "keywords": [
        "Mobile App Development",
        "Distributed Systems",
        "Functional Programming",
        "Scalable Cloud Architectures",
        "Audio Programming",
        "IoT"
      ]
    }
  ],
  "references": [

  ]
}
